<a href="https://colab.research.google.com/github/Akshithkumarreddy/Pandas_tutorials/blob/main/10-Reading%20and%20Writing%20Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Reading & Writting in Pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.read_table("Data/data.txt")

In [ ]:
df2=pd.read_table("Data/data2.txt")
df2

    Tom,80,M
0   Tim,85,M
1   Kim,70,M
2  Kate,90,F
3  Alex,75,F

In [ ]:
df2=pd.read_table("Data/data2.txt", sep=",")
df2

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

In [ ]:
df=pd.read_table("Data/data2.txt", sep=",")
df

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

In [ ]:
df=pd.read_table("Data/data2.txt",
                 sep=",",
                 header=None)
df

      0   1  2
0   Tom  80  M
1   Tim  85  M
2   Kim  70  M
3  Kate  90  F
4  Alex  75  F

In [ ]:
df=pd.read_table("Data/data2.txt",
                 sep=",",
                 header=None,
                 names=["name","score","sex"])
df

   name  score sex
0   Tom     80   M
1   Tim     85   M
2   Kim     70   M
3  Kate     90   F
4  Alex     75   F

In [ ]:
df=pd.read_table("Data/data2.txt",
                 sep=",",header=None,
                 names=["name","score","sex"],
                 index_col="name")
df

      score sex
name
Tom      80   M
Tim      85   M
Kim      70   M
Kate     90   F
Alex     75   F

In [ ]:
df2=pd.read_table("Data/data3.txt",
                  sep=",")
df2

  lesson  name  one  two
0   Math   Kim   80   85
1   Math   Tim   90   70
2   Math   Tom   70   95
3   Stat  Kate   65   90
4   Stat  Alex   85   80
5   Stat   Sam   55   70

In [ ]:
df2=pd.read_table("Data/data3.txt",
                  sep=",",
                  index_col=["lesson","name"])
df2

             one  two
lesson name
Math   Kim    80   85
       Tim    90   70
       Tom    70   95
Stat   Kate   65   90
       Alex   85   80
       Sam    55   70

In [ ]:
df3=pd.read_table("Data/data4.txt",sep=",")
df3

                          #hello
name                score    sex
#scores of students NaN      NaN
Tim                 80         M
Kate                85         F
Alex                70         M
Tom                 90         M
Kim                 75         F

In [ ]:
df3=pd.read_table("Data/data4.txt",
                  sep=",",
                  skiprows=[0,2])
df3

   name  score sex
0   Tim     80   M
1  Kate     85   F
2  Alex     70   M
3   Tom     90   M
4   Kim     75   F

In [ ]:
df3=pd.read_table("Data/data4.txt",
                  sep=",",
                  skiprows=[0,2],
                  usecols=[0,1])
df3

   name  score
0   Tim     80
1  Kate     85
2  Alex     70
3   Tom     90
4   Kim     75

In [ ]:
df3=pd.read_table("Data/data4.txt",
                  sep=",",
                  skiprows=[0,2],
                  usecols=[0,1],
                  nrows=3)
df3

   name  score
0   Tim     80
1  Kate     85
2  Alex     70

## Writing Data

In [ ]:
df=pd.read_csv("Data/data.txt",sep="\t")
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [ ]:
df.to_csv("Data/new_data.csv")